content-org/personal_lists.org
#+hugo_section: personal_lists

* Beliefs
:PROPERTIES:
:EXPORT_FILE_NAME: beliefs
:END:
I was inspired by [[https://busterbenson.com/beliefs/][Buster Benson]] and decided that i need a page where I can openly state my views on things that are external to me. Basically opinions masqueraded as beliefs.

** Writing
- small case writing is so so much more superior than anything else out there also no punctuation is just cherry on top plus making spelling mistakes and not deciding to correct deserves a chefs kiss we only use lower case cuz fuck capitalism
** Education
- we educate for two things, to take the human race forward in the right direction, so that one can live their life to their fullest
** Text editors
- emacs is goku

